{"podcast_details": {"podcast_title": "After Hours Entrepreneur with Mark Savant", "episode_title": "NEIL PATEL - Artificial Intelligence SEO Secrets revealed", "episode_image": "https://storage.buzzsprout.com/variants/wovjtiy9ssdtl0f0i9c7xstoknq2/f6fd9b4ca4e468e7e11c8350463c894b252ee834d352e0a8d889b97ac83aedef.jpg", "episode_transcript": " We've got world famous SEO expert Neil Patel in the house. Neil, save my website. I got to ask you about AIs. AI-generated content going to kill my website's SEO. Stana, is it going to kill your website's SEO? Because it depends how you're using AI-generated content. So let's go back. Most people create AI-generated content either through BARD or ChatGPT. Right now, it's mainly through ChatGPT. Or you're going to use a lot of other tools like the Ubersuggest AI Rider, which we have and a lot of others do. And a lot of us are just using APIs from ChatGPT, but we're modifying them to be SEO friendly or whatnot. Here's the thing. Their index is from 2021. It's not up to date. So if you haven't created a piece of content on, let's call it, Why You Should Eat an Apple a Day. All right? There's probably a lot of articles. I'm actually going to Google Why You Should Eat an Apple a Day. All right, so check this out. Right now, on my screen, I'll actually share my screen, because why not? We're going to do this. Let's just do this. Do it right. Look at this. There's a billion plus results right there. That's a lot. If I actually enable, Ubersuggest Why You Should Eat an Apple a Day. It's not that search of a term out there. There's other terms that are a little bit more popular. Eating an apple a day for a month. That's 260 searches benefits eating apple. All right. So there's not a ton of searches. Here's the top 10 results. Then you're going to the page two. Then you're on a page three. No one really goes past page three. So barely anyone searches for this term. But yet, there's a billion results. All I'm getting at is Google's drowning out the noise. And what AI content is doing is creating a ton of generic copycat, where is Waldo type looking like content, in which everything looks the same. There's nothing unique, new, or fresh. So is AI going to kill your SEO? Not necessarily. Is it going to get you a ton of traffic? Not really. What you need to do is, if you want to use AI, is have a human go in there and modify it. AI can help you start the writing process. You need a human to add their experience, their expertise, their authority, and their trust to make it stand out, make the article pop. So that way, Google wants to rank it. Love that. So what tools are you using? On my website, I'm using stuff like Yoast. I'm using the Google keyword add tool to look at what the search inquiries use. TubeBuddy, vidIQ. These are some of the tools I use to see what keywords, how I want to start videos, what I want to start my post with. What's your favorite tool? I also use this tool called askthepublic.com. You may have heard of it. Yeah. Ask the public. Yeah, you may have heard of it. That's a pretty good one. What tools do you suggest to make sure that I can actually show up on page one of Google? Because I don't want to be one of those page five. Page five, there is no page five. What tools can I use to hit top page of Google? Ask the public is a great one, but I'm biased because we own it. Ubersuggest is another one. Again, biased because I own it. SEMrush is great. Ahrefs is great. Moz is good. There's a lot of tools out there. Problem isn't what tools you need. The issue is to do really well, you need amazing content, a great user experience, and you need backlinks. So people aren't going to really link to you unless you have a great user experience and you have a great content. Great user experience you can solve over time. You just keep tweaking and adjusting based on where users have issues, make sure your site loads fast, things like that. Content, people are lazy and they don't want to write amazing content. Or they want to write similar content to their competition, but nothing unique, new, and fresh. People don't want to read stuff that's already been regurgitated 1,000 times. They want to read stuff that's fresh and new. That's the struggle most people have when it comes to ranking well in Google. So you've got to hit them with something that's unique and different. Like one of the things that I think a lot of podcasters make the mistake of doing is agreeing with everything that the guest says. Yeah, and they shouldn't. And they should agree with whatever they think is right. Exactly. Of course you want to be able to back it up with facts, logic, data, and stuff like that. That's one of the things that I try to focus on. So I want to get your opinion on this, Neil. I hear people say this all the time. AI won't take your job. Someone using AI will take your job. But it's the same damn thing. What's the difference? I do think AI is going to replace a lot of people's job. Not in the short run. I think that's more of a long term thing. In the short run, the real value is, because if you look at most AI, it doesn't work out of the box. We can just do everything for you. It's not like this magic pill. You need humans to help you get there. And for that, you're going to have to go and spend a little bit of money paying people, or a decent amount of money paying people to help you figure it all out. So what do you think, what are you doing, Neil, to stay relevant, to stay impossible to replace? Like, when every single level of every single industry is going to be disrupted, Neil, what are you doing to stay relevant in this AI realm? Sure, so the first thing I'm doing is, I'm continually creating my own content. Instead of having AI do it, I'm creating new, fresh things, versus having an index of the web go scrape the web and go create similar content. Instead, I'm doing new, fresh stuff that others aren't talking about. So that will help me stand out. The second thing I'm doing is doing different things in marketing than my competition. So instead of only focusing on content, we focus heavily on tools as well. Well, we'll have tools like Answer the Public or Ubersuggest. We'll give away tons of stuff for free that people are used to paying for. So it starts helping you build an audience. The next thing we do is we focus on community. How can you actually help people and care from? I'm not talking about just podcasting or videos, but when people ask you questions, how can you answer them and help them out? How can you pick up the phone when this mom calls you who's running a bed and breakfast, has no money to pay my ad agency, NP Digital, but yet if I help her, it can change her life. You go and you help her, and yeah, you may not be doing as much as someone paying you a million bucks, but still, you do what you can. You improve her situation, and you give yourself a pat on the back for doing the right thing, right? You just go above and beyond, and you care for people, and you care for the community. Which as you get bigger, becomes more difficult, right? You've got millions of followers now all over the world, so it's tough for you to answer DMs, they get on phone calls. When are we gonna get the Neil Patel chatbot? My team has been working on it, and I refuse to put it out there. You refuse, so I wanna hear about this. I was talking to Chris Doe about this a few months ago. He's a guest on the show, and he's building out a Chris Doe bot, which I mean, obviously I'm gonna love that. Like, why would you be hesitant to put out a chatbot? It enables a lot of people. It enables you to scale your conversation with fans. Why not? I don't like the idea of just automated chats. I want it to be, have that human touch, and I just don't see that from an AI bot. And I'm not saying it's a bad thing to use an AI bot, it's just not my thing. I enjoy that one-on-one connection. I enjoy meeting people. I don't care if they're rich or they're poor, they're starting off, or they're smart for us in the world. I enjoy it, so why not continually do it? That's fair, and I appreciate that, because I'd much rather talk to the OG rather than the.ai Neil Patel, you know what I mean? Yeah. Speaking of that, so I find this interesting. It's a little bit off topic, but you're probably familiar with this company, Replica.ai. It has these chatbots that speak to humans. And what ended up happening was young men started sexting these chatbots, and basically ended up dating these chatbots. You've got kids, I've got kids. Are you at all worried that our kids are just gonna all end up dating AI chatbots in the future? Never thought about that, but I hope they're not dating these AI chatbots. When I first met my wife, I remember we were in New York City, Central Park. She got ice cream with the ice cream cone. She wanted the perfect picture. And she was getting frustrated that I wasn't gonna take any pictures, so her ice cream was melting. I was like, honey, I'm gonna get a new ice cream cone. And she wasn't mad at me or anything like that. But what she was doing is she was living in what I call the Instagram moment. Life's not about the Instagram moment. And I explained it to her right then and there. I'm like, we're here in Central Park. Let's enjoy it for what it is. We don't need a perfect picture that gets a ton of likes. What we need is we need amazing memories with each other and our families and our friends. We don't need to optimize for this social platforms out there that everyone really craves and says, oh, I got a lot of likes. I should be happy today. If I didn't, I should be sad today. It's just a bunch of bull. I don't want my kids, which will get even worse, which there's AI chat bots and all this kind of stuff like you're saying and have a relationship with AI. I want them to have relationships with other humans. Don't care who they, why can't you care who they marry? But what I mean by that is I don't care about someone else's religion or color or any of that. That kind of stuff doesn't bother me. You do you, you do what makes you happy. As long as they're a good ethical person, I'm happy. I'll accept whoever they are. But my big issue is, is like, if people start living their life for AI or the internet or for other people's approval, I think it's just terrible. I think what kids go through these days sucks. I remember when I grew up, you played basketball and you're outside and you had fun and you got dirty. It's just like, now, oh, let's just sit on our phones all day and play video games. Dude, one of my family members is playing a video game with his friend who's like two houses down. Like, all right, they're on the computer, too much playing games. Why not just go to each other's house and play next to each other? Like, why do you need to chat through a computer when your few house is down? Like, we just didn't do that crap when we were growing up. It's like, where's the socialization? It's pretty wild. And I'm with you there. I go to the park and play with my kids and just about every parent is on their phone. And I'm a huge AI adopter. I'm all about it. But there's definitely a point where it's like, we lose our humanity. And don't get me wrong. It would be lovely to have a wife and spouse that agreed with everything I said and whispered me sweet nothings and knew me. It would never challenge me. But you've grown a massive business. Where's the fun in that in life, right? The ups and downs and the crazy moments and the sad moments and the happy moments, all those kinds of things. It's what makes life amazing. Yeah, do you think you could even be the best version of yourself if you were surrounded by people who just said, yes, Neil, do whatever feels good? No, two, I would get bored. Three, what am I gonna learn in life? How am I gonna improve as an individual if everyone just keeps saying yes? Yeah, it's kind of a crazy thing. Anyway, I'm glad we went down that rabbit hole for a second because I'm worried that my kids are just gonna be dating some beautiful zebra online that just tells them everything that they wanna hear all the time. It's gonna get weird. Yeah, it's gonna get weird. It's gonna definitely get weird. Okay, cool. Staying on this AI topic, the other concern of mine when it comes to AI content, is obviously we want more content for our website. AI is a really, really efficient way of getting there, is what's the hazard of having AI generate incorrect information? There was an attorney who recently referenced a fake case because he was using chat GPT to prepare for court, gotten a little bit of a trouble. So how are you getting in trouble? Or her getting in trouble? This is like, you should get in trouble. Your attorney, you pass the bar exam, you should double check and not rely on AI and be lazy. Yeah, so how, I mean, obviously we wanna make a lot of content, right? But we also don't wanna cut so many corners that we're citing fake or incorrect or invalid content. What steps are you putting into place to make sure that everything that goes into your website, Neil, is legit, 100%? I have a team for that and they just make sure everything's on and I trust them so I don't really have to worry. I don't really take tons of steps to worry about that kind of stuff. We have 700 and something people at the ad agency. Enough people, there's enough checks and balances where I don't worry too much. I still do check in on once every once in a while and question things, even if I don't even think that anything's wrong, just so people know I'm paying attention. That's a good one. I definitely like, so question about scaling a business, right, I'm at about 10 team members now, bringing on some new ones. You're at 700 so you're a little bit ahead of me. How accessible are you to your team members? Like how important is that vertical integration with the communication? I'm accessible, anyone who messages me that's part of the company, I try to talk to them when possible. It's impossible to talk to everyone every single day or even every week, there's too many people. But the way we look at it is there's layers within a corporation and I don't know everyone. I never will, I wish I did. That's just not the reality. And I try to be there whenever I can, whether it's team meetings or all hand and we're in a lot of different countries so there's just no way I can meet everyone. And so we get that Neil Patel chat bot and then you could be everywhere all at once, stop that. That's right. I'll create the hologram at the same time too, put a little hologram thing in everyone's office and then they can see me, they can interact with me in real time. There's just got the Neil Patel behind you all the time, I like that. So another question, kind of on this same note, how do you go from serving mom and pop businesses to serving companies like Amazon, Microsoft, Airbnb, how do you make that jump? You don't make the jump, it's a transition and everyone believes you, oh yeah, I'm just gonna go land these big accounts, it doesn't work that way. You gotta crawl before you can walk and you gotta walk before you can run and it just takes a long time and you gotta slog it out and keep working your way upstream. You gotta work for mom and pops, you'll get referrals, eventually some mid-size companies will hire you, you keep doing good work, maybe they introduce you to some other mid-size companies, keep doing your work, more mid-size companies, some of those employees start working at larger corporations, do good work, they're like, oh yeah, we worked with this company, I know we were mid-sized but they did great work. You start with some of these large companies but now they're only giving you tiny contracts because you never really worked with large corporations, you do good work, they're like, oh maybe they'll give you mid-size contracts when you work with these large corporations, you do more good work, they'll keep only giving you mid-size contracts but then they give it to you for more divisions and more regions because a lot of them are global and then you keep doing more good work and then you can get larger contracts for a lot of divisions at a lot of regions. That's kind of the under-promised over-deliver. Yes, and be patient, not like one or two years or five years, give it 10 plus years. So I appreciate that because I'm seeing some success in my business, I run a podcast agency, I help business thought leaders launch, automate and grow podcasts and my largest ticket offer right now is 5K, that's for basically a launch with eight episodes from ID to iTunes, right? But now that I'm seeing success, people are coming to me and saying stuff like, Mark, 5K isn't enough, you should be charging 80K and I'm like, I agree, I'd like to and I sometimes struggle with, is this imposter syndrome or is it me waiting to be at the right time, to have the right processes, the right team? Right team, right processes, right results and the right type of clientele. So because even the big companies, just because a company is worth a hundred billion dollars or a trillion dollars, it doesn't mean they're gonna spend 80 grand, if you're worth a trillion dollars, spending 80 grand is like spending a dollar, right? Or maybe even less, I don't know proportion-wise, but you get the point, it's not much, it's insignificant. But just because it's insignificant doesn't mean they're gonna just waste it. It has to be the right price for the right value. What role has your YouTube channel had on you landing big accounts like the Amazon, Amazon, it's like the Amazons and Microsofts? Not as much as you think, it's not even SEO, it's not YouTube, it's none of that. Branding does help, what helps more than anything is just doing really, really good work for a lot of different companies and over time, those employees switch jobs and you get more accounts as they switch to different companies. That's typically how you get those bigger accounts. The YouTube, the SEO help build a brand, gives you credibility. The way you get the contracts though is you provide amazing work, which we talked about, and as people refer you to other companies or move around jobs, eventually someone will lend at large corporations and you'll get bigger contracts. I mean, looking at the digital landscape, it's like shifting all the time. I was talking to Eric Su about this the other day. It's Google Ads, then it's Facebook Ads, then it's TikTok influencers, and then it's something we haven't even heard of yet. Yeah, TikTok Ads and podcasting ads, and they're like, oh, people are using text messaging, but ads in your text message, plus, cause I got a big list. Like it's never ending. Yeah, it's never ending. So- Your fridge has an LCD screen. Did you know you, ads in that too. Tell them to order Alta Dina milk instead of horizon milk. I'm making this up at this point, but you get the point, right? It's never gonna be ending. Yeah, it's never ending. So it just seems like you're always on this hamster wheel where as soon as you've got it figured out, it's like Google doubles the price of the ads. Like, so what is an evergreen strategy for staying top of mind and building up that traffic? So one, I like the hamster wheel. For me, it's fun. It just keeps things exciting and you keep learning more. The best strategy to keep getting that traffic is don't worry about the platform, whether it's an SEO and you're blogging on your own site, or whether it's YouTube or LinkedIn or Twitter or Facebook or TikTok, just focus on creating amazing, amazing content with the four elements I talked about, Google breaks them down, experience, expertise, authority and trust, and use that content all over the web. You'll stand out, you'll do well, especially in a world with AI, which is what I'm looking forward to because yes, there's gonna be a lot more content creation, but more people are gonna use AI to do it. So it's gonna be easier to stand out. I mean, that's something I worry about. Elon Musk was saying the other day that the New York Times is like the Twitter version of diarrhea because they're just posting 100, 200 times a day. And so the quality of the content suffers. But there's this balance because content content, like Gary Vee, you gotta produce 70 pieces of content a day. But how do you do that? I don't have a team of 17 people following me around. AI seems like a really good way to do that. Or you just produce less content and you make it amazing and you repurpose it. So you create like a long form podcast episode like this. Well, we can create tons of shorts from that. That'll be like four, five, six pieces of content. The long one will be another one. And then what we could also do is we can transcribe them into a few different articles, right? So maybe you got a few more pieces there. We can also take some of the quotes in this podcast episode, make them some images and some cool stuff. You'll probably produce 10 to 15 pieces of content just from this one 30 minute podcast episode. That's how you scale it up. And as you get better, you can take the Gary Vee approach and start hiring more and more people. But at the beginning, repurpose. Yeah, we don't, I mean, repurposing is what I'm all about. That's why most podcasters quit is they underestimate how difficult it is to create all the content. It's like- Yeah, or they'll do like 10 episodes and be like, ah, this is a lot of work. I didn't get enough traction. Like, well, you'd created 10 episodes, you'll do it in a few months, try doing it for five years. Props, yes. It's not easy, but that's what we try to do is try to make it easier. Speaking of which, like a selfish personal question here, I'm putting a lot of podcast episodes up on websites, like this interview is gonna go up on the MarkzSpot Media website. And one of the challenges that I have is figuring out like what's the best keyword for my article. What are your thoughts on using your guest as where the key words for your blog posts? I think it's a great idea. Why wouldn't you? Especially if your guests are popular. Let's say Tony Robbins. Tony Robbins is super popular, everyone around the world, or a lot of people around the world know who he is. Why would you do that? Or Kim Kardashian. If you had Kim Kardashian, use it as a keyword. Why not? Well, so my thought is, that was my initial thought. It's good to know that my intuition is spot on. But the flip side is that, well, now I have to compete. Neil Patel has probably 100 million impressions on the web. Now I have to compete against a lot of, there's a lot more competition, right? Yeah, but that's okay. There's also a lot more search traffic too. So you'll get a portion of that and it all adds up. Fair, fair, good point. How important do you think it is for podcasters and content creators to create separate posts for each podcast episode? Or should I just have a single podcast page? Easier to do that. I just have a single podcast page with an embedded player. You need a page for each episode. Assuming each episode can be detailed, descriptions, reviews, all that kind of good stuff. The reason I asked you that question, again, cause I wasn't fully paying attention, and it was because of this, check this out. What is the most searched query on Google worldwide? All right, so number one is a brand. Number two is a brand. That's YouTube, Facebook. Number three is Google. That's a brand. Four, WhatsApp, web. I'll count that as a brand cause it's WhatsApp. They just want to use the web version. Five is weather. Let's not count that. Gmail is a brand. That's five now. Translate is not a brand. Amazon's a brand. That's six. Google Translate. They're just looking to translate stuff. That's not a brand. Instagram is a brand. So seven out of 10 of the most popular searches on Google, I'm assuming you can still see my screen, are brands. So people are brands as well. Search volumes for people go through the roof. Great example, messy signs with Miami, whatever it's called, I don't know the- Miami Inner, baby. All right, are you based out of Miami? Just north of Miami, yeah. There you go. Everyone started searching for messy. When he scored a goal, oh my God, it was ridiculous. Yeah, the internet blew up, which is another thing I think about. How much of my content should be trending topics everyone's searching for, and how much should be evergreen that's still valuable five years from now? We spend 80 plus percent of our time on the evergreen stuff. Is so- Consistent traffic. We spend like 20% of our time on the short-term stuff. Interesting. Interesting. Super good. Neil, thanks for joining the show here today, brother. You really, I think, highlighted a lot of things we should be thinking about. Another quick question. How often are you using ChatGPT in your everyday actions? Two, three times a week. Okay. Is there another AI tool that you're using regularly? Bard. We use Bard quite a bit. My team and the company use all these tools daily. We use it more for cases that most people don't think about. Everyone's like, oh my God, it can help us create content. I'm like, yeah, all right. We use it for things like, oh, we have all this data and analytics. Oh, we can use AI to help us analyze the data and make better informed decisions as marketers. That kind of stuff, we use it on a daily basis. I think a lot of people think that AI is like the end of the world, and I think there's some concerns that we should have, but it might just be the savior of the world, because when you look at stuff like climate change, for example, like a tiny little beetle might go extinct or might die out, and then that impacts the trees, which impact the winds, which impact. So with so many different data points, I feel like AI, leveraging AI's supercomputing power to take in all these data points, it just seems like it's gonna be able to give us more insights than just my tiny little peanut size brain could come up with. That's my thought. Yeah, I think you get help in many ways, and there's a lot of amazing use cases for it as well. It's not all bad. Word up, Neil, where's the best place for us to find your brother? My ad agency, NP Digital. NP Digital, you heard it here first. Neil Patel, thank you, brother. Thanks for having me."}, "podcast_summary": "Summary of the podcast:\n\n- The discussion revolves around AI-generated content and its impact on SEO.\n- It is important to understand that AI-generated content is not updated and may result in generic copycat content that lacks uniqueness and freshness.\n- AI can be used to start the writing process, but human input is necessary to add expertise and make the content stand out.\n- Tools like Yoast, Google keyword add tool, TubeBuddy, vidIQ, and askthepublic.com are recommended for keyword research and SEO optimization.\n- It is crucial to focus on creating amazing content, improving user experience, and obtaining backlinks to rank well on Google.\n- In terms of AI replacing jobs, it is believed that AI will gradually replace certain roles, but in the short run, human collaboration with AI is necessary.\n- Neil Patel suggests staying relevant by continuously creating fresh content, focusing on tools, building a community, and providing value to others.\n- The podcast also delves into the dangers of AI-generated incorrect information and the importance of ensuring the quality and accuracy of content.\n- Neil Patel emphasizes the significance of providing exceptional work and building a reputation to attract bigger clients.\n- The ever-changing digital landscape requires content creators to adapt and stay on top of new platforms and trends.\n- The strategy for staying relevant and building traffic is to consistently create amazing content with expertise, authority, and trust, and repurpose it across various platforms.\n- It is recommended to have dedicated pages for each podcast episode for detailed descriptions, reviews, and to incorporate relevant keywords.\n- The conversation also touches on the balance between trending topics and evergreen content and the potential benefits of AI in data analysis and decision-making.\n- Neil Patel mentions that AI can be a helpful tool and has various use cases that go beyond content creation.\n- AI can offer insights and benefits in areas like climate change and data analysis.\n- Neil Patel's ad agency, NP Digital, is the best place to find more information about his work.", "podcast_guest": "Neil Patel", "podcast_highlights": "- Highlight 1 of the podcast: \"What AI content is doing is creating a ton of generic copycat, where is Waldo type looking like content, in which everything looks the same. There's nothing unique, new, or fresh.\"\n- Highlight 2 of the podcast: \"To do really well, you need amazing content, a great user experience, and you need backlinks. People aren't going to really link to you unless you have a great user experience and you have great content.\"\n- Highlight 3 of the podcast: \"Instead of having AI do it, I'm creating new, fresh things, versus having an index of the web go scrape the web and go create similar content. Instead, I'm doing new, fresh stuff that others aren't talking about.\"\n- Highlight 4 of the podcast: \"So what you need to do is, if you want to use AI, is have a human go in there and modify it. AI can help you start the writing process. You need a human to add their experience, their expertise, their authority, and their trust to make it stand out, make the article pop.\"\n- Highlight 5 of the podcast: \"The best strategy to keep getting that traffic is to don't worry about the platform, whether it's SEO and you're blogging on your own site, or whether it's YouTube or LinkedIn or Twitter or Facebook or TikTok, just focus on creating amazing, amazing content with the four elements I talked about: experience, expertise, authority, and trust.\""}