{"podcast_details": {"podcast_title": "Two Guys on Your Head", "episode_title": "Merit", "episode_image": "https://kutkutx.studio/wp-content/uploads/2022/04/2GUYS_ON_YOUR_HEAD-itunes-3000x-041822.jpg", "episode_transcript": " We're tracing the decisions that gave us the housing situation we have in Austin today. In Growth Machine, how Austin engineered its housing market. Find it wherever you get your podcasts. From KUT, in KUTX Studios. Think about this. Our brains change. Memory is an amazing thing. What you think is in there is really... Our brains aren't finished. They're not fully cooked yet. Our brains aren't finished. They're not fully cooked yet. You go with your heart. You don't have any idea why we're doing what we think that we're doing. Because we're so smart. But here's the deal. I mean, if somebody plays really well in tune, but their rhythm is lousy, it doesn't average out. I'm Bob Duke. I'm Art Markman. I'm Rebecca McEnroy. And this is Two Guys on Your Head. Today, the psychology of merit. We live in a society that believes that people should be promoted and receive recognition on the basis of their merits. Unfortunately, there is not always a great rubric for determining what merit really is. So ultimately, it is an evaluation and therefore a little bit fuzzier than it might appear at first blush. Yeah. And I think all of us perceiving ourselves in our own experiences like to think, because it feels good to think this, that I got where I am because I worked hard and I was responsible and I did the right thing. Where did people like me? Exactly. But of course, one of the things that is often omitted from that thinking are all of the attendant circumstances that facilitated each one of us achieving whatever the heck it is that we think we've achieved. But I think one of the factors that we often don't take into account is that there has to be a definition of what success means. And that definition is cast by the people who are already successful. Exactly. And so when we look at success in companies, when we look at success in publishing, when we look at success in academia, the definition of merit is a definition that itself comes from a position of relative privilege. And we have to recognize that as well, that there may actually be multiple routes to deserving recognition for merit, not all of which are going to look like the more traditional approaches. And that's such an important point to make because who gets to define what is in fact meritorious? And for most people, it means things that seem quite sterile in the sense that they can't be contaminated by other kinds of influences. So people believe, for example, that standardized test scores are, you know, what could be more fair than that? Everybody takes a test, everybody takes a test, highest scores win, and there you go. But of course, you know, you look at that a little more carefully and you see that there are all kinds of circumstances that influence someone's test score, you know, not the least of which is having, you know, the ability to take prep classes or to take the test multiple times because you can afford to. So there are all kinds of things that lead to those kinds of things. So you know, it's an important thing when people say we should be making judgments based on merit. Well, the next question is, and what defines that? And as importantly, who defines that? What in fact constitutes merit? And of course, when you grow up with a particular definition of merit, that comes to feel self-evident. Yeah. You know, at some point, you don't necessarily think of it as, oh, this is actually an arbitrary set of criteria that a particular group determined counted as merit. It just seems like, well, no, obviously that's the way it is because it becomes embedded in the culture. Yeah. And one of the reasons that that's complicated is that the things that are easiest to measure are not always the most important things. Or the most meritorious. Or the most meritorious. But they seem attractive because I can assign a number to it. And so look, and you know, when four is more than three and 4.6 is more than four, and so what's the problem? But here's the thing that's interesting about that. I think all of the efforts to sort of remove the potential contamination of nefarious forces from things, what really happens is we're trying to remove human judgment because in order to make a decision about anything really important, generally it's complicated. There are a lot of factors and they interact. They're not additive. I mean, if somebody plays really well in tune, but their rhythm is lousy, it doesn't average out. You know, like, well, they're a pretty good musician. No, their rhythm is lousy. So it's not a matter of just adding up the components to get to a full score. And that that formulating an overall picture is what human brains do very well. But the concern is, of course, human brains are subject to biases based on preconceived notions and stereotypes and all kinds of things. And as a way to sort of insulate decisions about merit from those biases, we say, well, what's the simplest way we can generate a number that we can make comparative decisions about individuals and that's what we'll start using for merit. But then on the other hand, it's something I think we've talked about on previous shows. Our wonderful colleague here at UT, Paul Woodruff, has made this distinction between ideals and their doubles. And so the concept of merit is an ideal and consequently is subjective in character because it has to take into account all of the things Bob was talking about that human brains do in order to really judge the performance of an individual in the context in which it was carried out. When we institutionalize concepts, we cannot rely on wisdom. And that's the word that Paul Woodruff uses, wisdom. We can't rely on that wisdom. So we institutionalize things and we create what Paul calls doubles of those ideals, which are procedural variants of them that can be carried out in a common way across different people. And that's when we build measurements that then stand in for the ideal we wanted. And so we go from creating a concept of merit that requires a certain degree of wisdom to building meritorious structures that involve things like in the context of college admissions, it might be things like grade point averages or test scores or other things that probably correlate with merit if you squint in the right way, but they don't correlate perfectly such that you have a certain number of people who may not be that meritorious but satisfy the criteria that have been measured. And some people who are extraordinarily meritorious but don't have the numbers to back that up that's why they're doubles to this ideal because they come out with answers that are kind of okay but they aren't really the wise answer. Next week we'll talk about stonewalling with Dr. Art Markman and Dr. Bob Duke. I'm Rebecca McEnroy and I produce Two Guys on Your Head for KUT Radio in Austin, Texas. What do you want to know about Austin? Our ATXplained project takes your questions about Austin's people, places, and things and goes the distance to answer them. Subscribe to the ATXplained podcast, find it on iTunes, Google Play, or your favorite podcast app, or go to ATXplained.org."}, "podcast_summary": "Summary:\n\n- The podcast discussed in this ad campaign is called \"Growth Machine\" and it explores how Austin engineered its housing market.\n- The podcast is hosted by Bob Duke, Art Markman, and Rebecca McEnroy, who also host another podcast called \"Two Guys on Your Head.\"\n- \"Two Guys on Your Head\" is a podcast that delves into the psychology of various topics, and in this episode, they discuss the psychology of merit.\n- The hosts discuss how society believes people should be promoted and recognized based on their merits, but determining what merit really is can be challenging.\n- They explore the idea that success and merit are often influenced by circumstances and definitions set by the already successful.\n- The podcast raises questions about the definition of merit and who gets to define it, highlighting that standardized test scores, for example, may not be the most fair or accurate measure.\n- The hosts also talk about the complexities of making decisions based on merit and the challenges of removing human judgment and biases.\n- They mention the concept of creating doubles of ideals when institutionalizing concepts like merit, which may not perfectly capture true merit.\n- The ad also promotes the \"ATXplained\" podcast, which answers questions about Austin's people, places, and things.\n\nOverall, the podcast ad campaign covers topics related to Austin's housing market, the psychology of merit, and answers questions about Austin in general. It aims to provoke thought and discussion on these subjects.", "podcast_guest": "Rebecca McEnroy", "podcast_highlights": "- Highlight 1 of the podcast: \"Our brains aren't finished. They're not fully cooked yet.\"\n- Highlight 2 of the podcast: \"There may actually be multiple routes to deserving recognition for merit, not all of which are going to look like the more traditional approaches.\"\n- Highlight 3 of the podcast: \"The things that are easiest to measure are not always the most important things or the most meritorious.\"\n- Highlight 4 of the podcast: \"It's not a matter of just adding up the components to get to a full score.\"\n- Highlight 5 of the podcast: \"We go from creating a concept of merit that requires a certain degree of wisdom to building meritorious structures that involve things like grade point averages or test scores.\""}